<a href="https://colab.research.google.com/github/Sreenavya04/B19_1244-PDS-/blob/main/29_08_2025.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [37]:
import pandas as pd
data=[10,20,30,40,50]
series=pd.Series(data)
print("Pandas Series")
print(series)

Pandas Series
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [38]:
#Custom index
import pandas as pd
data=[10,20,30,40,50]
index_labels=['a','b','c','d','e']
series=pd.Series(data,index=index_labels)
print("Pandas Series")
print(series)

Pandas Series
a    10
b    20
c    30
d    40
e    50
dtype: int64

In [39]:
#Creating a dataframe
import pandas as pd
data={
    'Name':['Alice','Bob','Charlie','David'],
    'Age':[25,30,35,40],
    'City':['Hyderabad','Delhi','Chennai','Mumbai']
}
df=pd.DataFrame(data)
print("Pandas DataFrame")
print(df)

Pandas DataFrame
      Name  Age       City
0    Alice   25  Hyderabad
1      Bob   30      Delhi
2  Charlie   35    Chennai
3    David   40     Mumbai

In [40]:
#Accesing data
print(df['Name'])

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [41]:
#Access multiple columns
print(df[['Name','City']])

      Name       City
0    Alice  Hyderabad
1      Bob      Delhi
2  Charlie    Chennai
3    David     Mumbai

In [42]:
#Access rows using index
print(df.iloc[1])
print(df.loc[2])

Name      Bob
Age        30
City    Delhi
Name: 1, dtype: object
Name    Charlie
Age          35
City    Chennai
Name: 2, dtype: object

In [43]:
#Adding a new column
df['Salary']=[400000,500000,600000,70000]
print(df)

      Name  Age       City  Salary
0    Alice   25  Hyderabad  400000
1      Bob   30      Delhi  500000
2  Charlie   35    Chennai  600000
3    David   40     Mumbai   70000

In [44]:
#removing a column
df=df.drop('City',axis=1)
print(df)

      Name  Age  Salary
0    Alice   25  400000
1      Bob   30  500000
2  Charlie   35  600000
3    David   40   70000

In [45]:
#Filtering the data
print(df[df['Age']>30])

      Name  Age  Salary
2  Charlie   35  600000
3    David   40   70000

In [46]:
#Basic Statistics
print(df['Age'].mean())
print(df['Age'].max())
print(df['Age'].min())

32.5
40
25

In [47]:
#Student data
import pandas as pd
student_data={
    'Student_id':[1,2,3,4],
    'Name':['navs','soups','vaish','karats'],
    'Marks':[85,90,78,92],
    'dept':['CSE','ECE','CSE','CSE']
    }
df=pd.DataFrame(student_data)
print(df)

   Student_id    Name  Marks dept
0           1    navs     85  CSE
1           2   soups     90  ECE
2           3   vaish     78  CSE
3           4  karats     92  CSE

In [49]:
import pandas as pd
data = {
    's-name': ['navya', 'archu', 'suppu', 'vaishu', 'karthisha'],
    's-rollno': [1244, 1329, 1011, 1554, 2099],
    'm1': [20, 15, 17, 18, 2],
    'm2': [16, 8, 19, 15, 18],
    'm3': [19, 3, 5, 17, 18]
}
df = pd.DataFrame(data)
df['Total'] = df[['m1', 'm2', 'm3']].sum(axis=1)
df['Average'] = df[['m1', 'm2', 'm3']].mean(axis=1).round(2)
df['Result'] = df['Average'].apply(lambda x: 'A' if x >= 17 else ('B' if x >= 15 else 'C'))
print(df)

      s-name  s-rollno  m1  m2  m3  Total  Average Result
0      navya      1244  20  16  19     55    18.33      A
1      archu      1329  15   8   3     26     8.67      C
2      suppu      1011  17  19   5     41    13.67      C
3     vaishu      1554  18  15  17     50    16.67      B
4  karthisha      2099   2  18  18     38    12.67      C